Revit 2026 API

# DWFImageQuality Enumeration

---

An enumerated type listing possible image quality for DWF Export.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DWFImageQuality
```
```vb
Public Enumeration DWFImageQuality
```
```cpp
public enum class DWFImageQuality
```
```fsharp
type DWFImageQuality
```

| Member name | Value | Description |
| --- | --- | --- |
| Default | 10 |  |
| High | 13 |  |
| Low | 11 |  |
| Medium | 12 |  |

#### Reference

Autodesk.Revit.DB Namespace